Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.ForceUnitEnum
The force unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.ForceUnitEnum.KG
Kilogram.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.ForceUnitEnum.TON
Ton.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.ForceUnitEnum.N
Newton.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.ForceUnitEnum.DAN
daNewton.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.ForceUnitEnum.KN
kNewton.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.ForceUnitEnum.LBF
Lbf.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.ForceUnitEnum.KIP
Kip.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.ForceUnitEnum.UNKNOWN
unknown unit.